### Movie Ranking ###
The purpose of this notbook is to import, clean, and combine two datasets to get the necessary sets of data to create a finalized table. The table will be used to build an interactive dashboard ranking different genres and movies from 1960's to 2010's.

Objectives:
- Import necessary files
- Inspect tables to identify errors and necessary data
- Clean and filter out the unncessary data
- Merge the tables to a final file (1960-2010_Movies.csv')

In [1]:
import pandas as pd

In [52]:
df_rating = pd.read_csv('/Users/noshintasnim/Downloads/title.ratings.tsv', sep='\t')
df_basics = pd.read_csv('/Users/noshintasnim/Downloads/title.basics.tsv', sep = '\t')

In [53]:
pd.set_option('display.max_columns', 500)
pd.set_option('display.max_rows', 500)

In [54]:
df_rating.tail(2)

            tconst  averageRating  numVotes
1602761  tt9916852            5.8         6
1602762  tt9916880            7.7        10

In [55]:
df_basics.tail(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
11843939,tt9916856,short,The Wind,The Wind,0,2015,\N,27,Short
11843940,tt9916880,tvEpisode,Horrid Henry Knows It All,Horrid Henry Knows It All,0,2014,\N,10,"Adventure,Animation,Comedy"

In [ ]:
# Cleaning the data to only include movies from 1960 to 2010
df_basics['startYear'] = pd.to_numeric(df_basics['startYear'], errors='coerce')
df_basics_fil = df_basics[(df_basics['startYear'] >= 1960) & (df_basics['startYear'] <= 2010)]

In [57]:
df_basics_fil.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
919,tt0000929,short,Klebolin klebt alles,Klebolin klebt alles,0,1990.0,\N,\N,"Comedy,Short"
965,tt0000977,short,Mutterliebe,Mutterliebe,0,1990.0,\N,\N,Short

In [58]:
df_merge = pd.merge(df_basics_fil, df_rating, on = 'tconst', how = 'inner')
df_merge.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,averageRating,numVotes
0,tt0000929,short,Klebolin klebt alles,Klebolin klebt alles,0,1990.0,\N,\N,"Comedy,Short",5.3,51
1,tt0015724,movie,Dama de noche,Dama de noche,0,1993.0,\N,102,"Drama,Mystery,Romance",6.3,33

In [59]:
df_merge.info()
df_merge.describe(include='all').transpose()
df_merge.isnull().sum().sort_values(ascending=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 674225 entries, 0 to 674224
Data columns (total 11 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          674225 non-null  object
 1   titleType       674225 non-null  object
 2   primaryTitle    674225 non-null  object
 3   originalTitle   674225 non-null  object
 4   isAdult         674225 non-null  int64
 5   startYear       674225 non-null  float64
 6   endYear         674225 non-null  object
 7   runtimeMinutes  674225 non-null  object
 8   genres          674225 non-null  object
 9   averageRating   674225 non-null  float64
 10  numVotes        674225 non-null  int64
dtypes: float64(2), int64(2), object(7)
memory usage: 56.6+ MB

tconst            0
titleType         0
primaryTitle      0
originalTitle     0
isAdult           0
startYear         0
endYear           0
runtimeMinutes    0
genres            0
averageRating     0
numVotes          0
dtype: int64

In [60]:
cols_to_drop = ['endyear', 'numvotes', 'originaltitle', 'titletype', 'isadult']
dfs = [df_merge]
for df in dfs:
    df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')
    df.drop(columns = [cols for cols in cols_to_drop if cols in df.columns], inplace =True)
df_merge = df_merge.sort_values(by='startyear', ascending=True)
df_merge = df_merge.reset_index(drop=True)
expected_columns = ['tconst', 'primary_title', 'genres', 'startyear', 'average_rating']

In [61]:
df_movie = df_merge
df_movie.head(2)

,tconst,primarytitle,startyear,runtimeminutes,genres,averagerating
0,tt0597557,Out at the Old Ball Park,1960.0,30,Western,7.1
1,tt0256922,The Big Trick,1960.0,95,"Crime,Drama",5.2

In [62]:
df_movie.tail(2)

,tconst,primarytitle,startyear,runtimeminutes,genres,averagerating
674223,tt1764754,Zise san batsos psofa san skylos,2010.0,40,"Action,Comedy,Short",4.1
674224,tt9916852,Episode #3.20,2010.0,\N,Drama,5.8

In [66]:
df_movie.to_csv('1960-2010_Movies.csv', index = False)